<a href="https://colab.research.google.com/github/urness/CS167Fall22Code/blob/main/Day03_exercise_solutions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>your name here</b><br>
Date: Sepetmber 6, 2022
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

## Part 1: Selecting columns in dataframes

In [ ]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv('/content/drive/MyDrive/CS167Fall22/Datasets/titanic.csv')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# what is the data type of titanic?
type(titanic)

pandas.core.frame.DataFrame

In [ ]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [ ]:
# display only the 'embark_town' column of the titanic data
titanic.embark_town

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [ ]:
# what is the data type of the result of the previous cell? 
type(titanic.embark_town)

pandas.core.series.Series

In [ ]:
# what is the "shape" of the data frame?
titanic.shape

(891, 15)

In [ ]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows
subset = titanic[-20:]
subset.shape

(20, 15)

In [ ]:
# make a subset that consists of the last 20 rows of the data and the columns: survived, pclass, sex, and age	
subset2 = subset[['pclass', 'sex', 'age']] 
subset2

     pclass     sex   age
871       1  female  47.0
872       1    male  33.0
873       3    male  47.0
874       2  female  28.0
875       3  female  15.0
876       3    male  20.0
877       3    male  19.0
878       3    male   NaN
879       1  female  56.0
880       2  female  25.0
881       3    male  33.0
882       3  female  22.0
883       2    male  28.0
884       3    male  25.0
885       3  female  39.0
886       2    male  27.0
887       1  female  19.0
888       3  female   NaN
889       1    male  26.0
890       3    male  32.0

## Part 2: Selecting rows: loc vs iloc

In [ ]:
# use loc to print out the data for passenger 890 on the titanic dataframe
# use iloc to print out the data for passenger 890 on the subset dataframe
print(titanic.loc[890])

survived                0
pclass                  3
sex                  male
age                  32.0
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [ ]:
print(subset.iloc[19])

survived                0
pclass                  3
sex                  male
age                  32.0
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [ ]:
# use a markdown cell; describe the difference between loc and iloc



```
loc ``` is a "label" ```iloc``` is an integer offset

## Part 3: Subsetting using series

In [ ]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function
queenstown_subset = titanic[titanic['embark_town'] == 'Queenstown']

In [ ]:
# how many passengers are in queenstown_subset?
queenstown_subset.shape

(77, 15)

## Part 4: Some Handy Functions

In [ ]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset['fare'].mean()

13.276029870129872

In [ ]:
# what is the average age for all of those in the queenstown_subset?
# do all of the passengers have an age recorded? What is recorded if there is no age?
queenstown_subset['age'].mean()

28.089285714285715

In [ ]:
queenstown_subset

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
32,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
790,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
825,0,3,male,NaN,0,0,6.9500,Q,Third,man,True,NaN,Queenstown,no,True
828,1,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# no age -> NaN

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

* unique -> Return unique values of Series object.
* mean -> average
* isnull -> Return a boolean same-sized object indicating if the values are NA. NA values, such as None or numpy.NaN, gets mapped to True values. Everything else gets mapped to False values.
* fillna -> Fill NA/NaN values using the specified method.

In [ ]:
# give examples of your use of unique(), mean(), median(), isnull()
print("unique values of deck: ", titanic['deck'].unique())
print("average age: ", titanic['age'].mean())
print("median fare: ", titanic['fare'].median())
print(titanic['deck'].isnull())

unique values of deck:  [nan 'C' 'E' 'G' 'D' 'A' 'B' 'F']
average age:  29.69911764705882
median fare:  14.4542
0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: deck, Length: 891, dtype: bool

In [ ]:
# load in the iris data
# what is the median sepal width of just the Setosas?
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
iris_data = pandas.read_csv('/content/drive/MyDrive/CS167Fall22/Datasets/irisData.csv')
iris_data

setosas = iris_data[iris_data['species'] == 'Iris-setosa']
setosas['sepal width'].median()

3.4

In [ ]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
versicolors_with_pl_gt_4 = iris_data[(iris_data['species'] == 'Iris-versicolor') & (iris_data['petal length'] > 4)]
versicolors_with_pl_gt_4['sepal width'].mean()

2.902941176470588